# ============================================================
# Shared Homebrew / Linuxbrew packages (macOS + Lima)
# ============================================================

# Core CLI tools
brew "git"
brew "zsh"
brew "tmux"
brew "tree"
brew "zellij"
brew "node"

# Containers / dev
brew "docker"
brew "docker-completion"
brew "lima"

# Shell / prompt
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Plumbing / libs / utils you already have or will likely want
brew "gettext"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "simdjson"
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "libevent"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libunistring"
brew "libuv"
brew "ncurses"
brew "pcre2"
brew "utf8proc"
brew "uvwasi"
brew "xz"
brew "zstd"
brew "lz4"

# Tools your vault / workflows depend on
brew "jq"
brew "awscli"
brew "bitwarden-cli"

# ============================================================
# macOS-only GUI apps and fonts (casks)
# ============================================================
on_macos do
  cask "ghostty"
  cask "claude-code"
  cask "font-meslo-for-powerlevel10k"
  cask "microsoft-edge"
  cask "mongodb-compass"
  cask "nosql-workbench"
  cask "rectangle"
  cask "vscodium"
end

# ============================================================
# Linux-only extras (optional)
# ============================================================
on_linux do
  # For now nothing special; shared brew() entries above already apply.
  # Add Linux-only stuff here later if you need it.
end

